[net]
batch=1
channels=3
height=200
width=200

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=512
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=512
size=3
stride=1
pad=1
activation=linear

[prelu]
n=512

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=linear

[prelu]
n=256

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
filters=256
size=1
stride=1
pad=1
activation=linear

[prelu]
n=256

[convolutional]
filters=52
size=1
stride=1
pad=1
activation=linear

[route]
layers=-39,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[prelu]
n=512

[convolutional]
filters=52
size=1
stride=1
pad=1
activation=linear

[route]
layers=-78,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[prelu]
n=512

[convolutional]
filters=52
size=1
stride=1
pad=1
activation=linear

[route]
layers=-117,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[prelu]
n=512

[convolutional]
filters=52
size=1
stride=1
pad=1
activation=linear

[route]
layers=-156,-1

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
filters=256
size=1
stride=1
pad=1
activation=linear

[prelu]
n=256

[convolutional]
filters=26
size=1
stride=1
pad=1
activation=linear

[route]
layers=-195,-1,-40

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[prelu]
n=512

[convolutional]
filters=26
size=1
stride=1
pad=1
activation=linear

[route]
layers=-1,-79

