[net]
batch=64
subdivisions=8
width=608
height=608
channels=3
angle=0
saturation=1.5
exposure=1.5
hue=.1
burn_in=1000
scales=.1,.1
mosaic=1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1,-7

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1,-10

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1,-28

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1,-28

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1,-16

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=85

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1, -3

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=54

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1, -3

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=0
size=1
stride=1
pad=1
filters=255
activation=linear

[yolo]
mask=0,1,2
anchors=12, 16, 19, 36, 40, 28, 36, 75, 76, 55, 72, 146, 142, 110, 192, 243, 459, 401
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
scale_x_y=1.2
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5

[route]
layers=-4

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=leaky

[route]
layers=-1, -16

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=0
size=1
stride=1
pad=1
filters=255
activation=linear

[yolo]
mask=3,4,5
anchors=12, 16, 19, 36, 40, 28, 36, 75, 76, 55, 72, 146, 142, 110, 192, 243, 459, 401
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
scale_x_y=1.1
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5

[route]
layers=-4

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=512
activation=leaky

[route]
layers=-1, -37

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=0
size=1
stride=1
pad=1
filters=255
activation=linear

[yolo]
mask=6,7,8
anchors=12, 16, 19, 36, 40, 28, 36, 75, 76, 55, 72, 146, 142, 110, 192, 243, 459, 401
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1
scale_x_y=1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5

[route]
layers=-162

[convolutional]
batch_normalize=0
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=0
filters=64
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=0
filters=512
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=0
filters=512
size=3
stride=1
pad=1
activation=linear

[prelu]
n=512

[convolutional]
batch_normalize=0
filters=256
size=3
stride=1
pad=1
activation=linear

[prelu]
n=256

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=linear

[prelu]
n=256

[convolutional]
batch_normalize=0
filters=52
size=1
stride=1
pad=1
activation=linear

[route]
layers=-39,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=512
size=1
stride=1
pad=1
activation=linear

[prelu]
n=512

[convolutional]
batch_normalize=0
filters=52
size=1
stride=1
pad=1
activation=linear

[route]
layers=-78,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=512
size=1
stride=1
pad=1
activation=linear

[prelu]
n=512

[convolutional]
batch_normalize=0
filters=52
size=1
stride=1
pad=1
activation=linear

[route]
layers=-117,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=512
size=1
stride=1
pad=1
activation=linear

[prelu]
n=512

[convolutional]
batch_normalize=0
filters=52
size=1
stride=1
pad=1
activation=linear

[route]
layers=-156,-1

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[convolutional]
batch_normalize=0
filters=96
size=3
stride=1
pad=1
activation=linear

[prelu]
n=96

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=256
size=1
stride=1
pad=1
activation=linear

[prelu]
n=256

[convolutional]
batch_normalize=0
filters=26
size=1
stride=1
pad=1
activation=linear

[route]
layers=-195,-1,-40

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[convolutional]
batch_normalize=0
filters=128
size=3
stride=1
pad=1
activation=linear

[prelu]
n=128

[route]
layers=-5,-3,-1

[convolutional]
batch_normalize=0
filters=512
size=1
stride=1
pad=1
activation=linear

[prelu]
n=512

[convolutional]
batch_normalize=0
filters=26
size=1
stride=1
pad=1
activation=linear

[route]
layers=-1,-79

